import React from 'react';
import './App.css';
import {BrowserRouter, Route} from 'react-router-dom';
import Navbar from './components/navbar'
import Home from './components/home'
import Footer from './components/footer'
import Songs from './components/song'
import Songdetail from './components/songdetail'

// const Home = (props) => {
//   return <div>Home</div>;
// }

// const Test = (props) => {
//   return <div>Test</div>;
// }

// const Check = (props) => {
//   return <div>Check</div>;
// }

// const Nomatch = (props) =>{
//   return <div>No match</div>
// }

// function App() {
//   return (
//     <BrowserRouter>
//       <Route exact path="/" component={Home}/>
//       <Route path="/test" component={Test}/>
//       <Route path="/test/:id" component={Check}/>
//       <Route component={Nomatch}/>
//     </BrowserRouter>
//   );
// }

// function App(){
//   const users=[
//     {"name":"raghu", "email":"bala@yahoo.com"},
//     {'name':'mama', 'email':"kumar@gmail.com"}
//   ];
//   const listItem=users.map((number) =>
//     <li>{number.email}</li>
//   );
//   return (
//     // <BrowserRouter>
//     //   <Route path="/" component={Navbar}/>
//     //   <Route exact path="/" component={Home}/>
//     //   <Route path="/" component={Footer}/>
//     //   <Route path="/song" component={Song}/>
//     //   <Route path="/song/:id" component={Songdetail}/>
//     //   <Route path="/singer" component={Singer}/>
//     // </BrowserRouter>
//     <div>
//       <h1>{listItem}</h1>
//     </div>
//   );
// }

const Fullsongs=[
  {
    "id":"1",
    "name":"Quit pannuda",
    "movie":"Master",
    "image":"https://i.ytimg.com/vi/SaZS9RaiUs4/maxresdefault.jpg",
    "link":"",
    "lyrics":"என் ஜீவனே என் போதையே நீ போதுமென்று தோன்றும் நேரம்தான் உன்னாலே நான் தல்லாடிய அந்த காலம் ஆறும் நேரம் இன்றுதான் அடிச்சது போதும்டா Out பண்ணுடா அழிஞ்சது போதும்டா Off பண்ணுடா குடிச்சது போதும்டா Quit பண்ணுடா ஓடச்சிதான் போடுடா தூக்கி போடுடா அடிச்சது போதும்டா Out பண்ணுடா அழிஞ்சது போதும்டா Off பண்ணுடா குடிச்சது போதும்டா Quit பண்ணுடா ஓடச்சிதான் போடுடா தூக்கி போடுடா அடிச்சது போதும்டா Out பண்ணுடா அழிஞ்சது போதும்டா Off பண்ணுடா குடிச்சது போதும்டா Quit பண்ணுடா ஓடச்சிதான் போடுடா தூக்கி போடுடா வலியான நேரத்தில பாத்துக்க யாருமில்ல நீ வந்த பக்கத்துல உன்னோட வாசத்துல உன்னோட பாசத்துல உளுந்தேன் உள்ள கோபம் இல்ல... உன்மேல கோபம் இல்ல நீ ஒன்னும் பாவம் இல்ல ஆனா நீ தேவை இல்ல என்னத்த நானும் சொல்ல... வார்த்தை இல்ல ஜுரத்தில நடுங்கின நேரத்தில மருந்தென நீதான் இருந்த குதிச்சு நான் ஆட்டம் போட்ட காலமெல்லாம் எனகென்ன நீ... தான் சந்தோசமும் சோகத்துக்கும் நல்லதுக்கும் கெட்டதுக்கும் நீதான் இருந்த இங்க முடிஞ்சுது உன் வேல... இப்போ விடுமா ஆள அடிச்சது போதும்டா Out பண்ணுடா அழிஞ்சது போதும்டா Off பண்ணுடா குடிச்சது போதும்டா Quit பண்ணுடா ஓடச்சிதான் போடுடா தூக்கி போடுடா அடிச்சது போதும்டா Out பண்ணுடா அழிஞ்சது போதும்டா Off பண்ணுடா குடிச்சது போதும்டா Quit பண்ணுடா ஓடச்சிதான் போடுடா தூக்கி போடுடா அடிச்சது போதும்டா Out பண்ணுடா அழிஞ்சது போதும்டா Off பண்ணுடா குடிச்சது போதும்டா Quit பண்ணுடா ஓடச்சிதான் போடுடா தூக்கி போடுடா இனிமே குடிப்பியா? No வாழ்க்கைய கெடுப்பியா? மாட்டேன் நமக்கு இது தேவையா நான் சொன்னா கேட்பியா? Yes Master இனிமே குடிப்பியா? No வாழ்க்கைய கெடுப்பியா? மாட்டேன் நமக்கு இது தேவையா நான் சொன்னா கேட்பியா? Yes Master இனிமே குடிப்பியா? NO வாழ்க்கைய கெடுப்பியா? மாட்டேன் நமக்கு இது தேவையா நான் சொன்னா கேட்பியா? சொன்னா கேட்பியா? கேட்பியா? Yes Master இனிமே குடிப்பியா? No வாழ்க்கைய கெடுப்பியா? மாட்டேன் நமக்கு இது தேவையா நான் சொன்னா கேட்பியா? சொன்னா கேட்பியா? Yes Master"
  },
  {
    "id":"2",
    "name":"Antha Kanna Paaththakka",
    "movie":"Master",
    "image":"https://i.ytimg.com/vi/Y4t27KY6qW8/maxresdefault.jpg",
    "link":"",
    "lyrics":"அந்த கண்ண பார்த்தாக்கா Love'u தானா தோனாதா அவன் கிட்ட போனாக்கா மனம் மானா மாறாதா அகமெல்லாம் அவன்தான் அவன்தான் இருந்தான் நடந்தால் அவன் கனவெல்லாமே அவன் முகம் தானே... அழகன்தான் அவன்தான் அவன்தான் அழகா அளவா அவன் சிரிப்பானே அட அழகன் தானே... பூப் போல மனசு... ஏறாத வயசு பாவம்டா நம்ம girls'u மத்தாப்பு சிரிப்பு, மாறாத நடப்பு Class'ahன master mass'u பட்டாசு பார்வை பட்டாலே போதும் Fail'ahன heart'u pass'u Single'னு news'u இதுதான்மா chance'u அந்த கண்ண பார்த்தாக்கா Love'u தானா தோனாதா அவன் கிட்ட போனாக்கா மனம் மானா மாறாதா அந்த கண்ண பார்த்தாக்கா Love'u தானா தோனாதா அவன் கிட்ட போனாக்கா மனம் மானா மாறாதா ஹா... ஆஅ... ஆ... Love'u தானா தோனாதா அகமெல்லாம் அவன்தான் அவன்தான் இருந்தான் நடந்தால் அவன் கனவெல்லாமே அவன் முகம் தானே... அழகன்தான் அவன்தான் அவன்தான் அழகா அளவா அவன் சிரிப்பானே அட அழகன் தானே... நட்பான பார்வை நிதான பேச்சு எல்லார்க்கும் புடிச்சி போச்சு மேக்னட்டு ஈர்ப்பு ரொம்பதான் ஷார்ப்பு எப்போதும் master top'u ஏதோ ஓர் power'u ஏதோ உன் திமிரு எப்போதும் இருக்கும் பாரு Solo'ah நின்னா ஏங்காதே பொண்ணா அந்த கண்ண பார்த்தாக்கா Love'u தானா தோனாதா அவன் கிட்ட போனாக்கா மனம் மானா மாறாதா அந்த கண்ண பார்த்தாக்கா Love'u தானா தோனாதா அவன் கிட்ட போனாக்கா... ஹா... ஆஅ... ஆ... Love'u தானா தோணாதா"
  },
  {
    "id":"3",
    "name":"En iniya Thanimaiye",
    "movie":"Teddy",
    "image":"https://i.ytimg.com/vi/wfH0ioSqLG0/maxresdefault.jpg",
    "link":"",
    "lyrics":"என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே புதிதான அதிகாலையோ புகை சூடும் நெடுஞ்சாலையோ உன்னோடு நான் நடந்தால் எல்லாம் பேரழகு மழை வீழும் இள மாலையோ இசையில்லா இடைவேளையோ என்னோடு நீ நடந்தால் இன்பம் என் உலகு உன்னோடு மட்டும்தான் என் நேரம் எனது உன்னோடு மட்டும்தான் மெய் பேசும் மனது மனிதரின் மொழி கேட்டு கேட்டு இதயம் பழுதாய் உணதமைதியில் தானே ஆனேன் முழுமுழுதாய் என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே அலை மோதும் கரை மீதிலோ மணல் பாதம் சுடும் போதிலோ உன்னோடு நான் நடந்தால் மண்ணே பூச்சிறகு கரைகின்ற அடி வானமோ குறையாத பெருந்தூரமோ என்னோடு நீ நடந்தால் இன்பம் என் உலகு என் தாயின் கருவில் என்னோடு பிறந்தாய் என் வாழ்வின் முடிவில் என்னோடு இருப்பாய் உறவுகள் வந்து சேரும் நீங்கும் நீதான் நிலையாய் அதற்க்கு உணர்க்கொரு நன்றி சொன்னேன் முதல் முறையாய் என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே இதுவரை கற்கா கலைகள் எல்லாம் உன்னுடன் கற்கும் வேளையிலே என்னுயிர் தோழி நீயென்பேன் நீயென்பேன் இதுவரை காணா காட்சிகளை உன்னுடன் காணும் வேளையிலே எந்தன் காதல் நீயென்பேன் நீயென்பேன் ஒரு சிலர் என்னை நெருங்க என்னிடம் பேச தொடங்க சிறு ஊடல் கொண்டு நீங்கி போகின்றாய் கவலைகள் என்னை வருத்த உன்னிடம் என்னை துரத்த உன் மடியை தந்து தாயாய் ஆகின்றாய் எனை துயிலென அணைத்திடு தனிமையே என் கனவிலும் தொடர்ந்திடு தனிமையே கண் விழிக்கையில் இருந்திடு தனிமையே தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே என் இனிய தனிமையே… ஓ என் இனிய தனிமையே… ஏ என் இனிய தனிமையே…"
  },
  {
    "id":"4",
    "name":"Friendship anthem",
    "movie":"Oh my kadavule",
    "image":"https://i.ytimg.com/vi/5p7paslm7Bo/hqdefault.jpg",
    "link":"",
    "lyrics":"நட்புக்கு வயதில்லை என்று ஒரு ஞானி சொன்னானே ஓ சொன்னானே மெய்யான நட்புகிங்கே பிரிவில்லை என்றும் சொன்னானே ஓ சொன்னானே Almost diaper கட்டும் காலம் தொடங்கி நாமும் தோள்கள் உரசி நடந்தோம் குஸ்தி fight'ம் போட்டு ஒன்றாய் முஸ்தபாவும் பாடி வாழ்வை கடந்தோம் நாம் எழில் நதிகளில் ஆடிய ஓடம் வற்றாத கடல் இந்த ரகசிய பாசம் நமக்குள் இருந்ததே இல்லை வெளி வேஷம்தான் Friendship'தான் சொத்து நமக்கு Friendship'தான் சொத்து நமக்கு Friendship'தான் சொத்து நமக்கு ஆயிரம் உறவு வந்தாலும் நண்பன் தான் கெத்து நமக்கு College'u cut அடிச்சு தல படம் போனோம் போனோம், போனோம் Exam'ல் bit அடிச்சும் just fail'u ஆனோம் ஆனோம், ஆனோம் சொத்தில் கூட பங்கு உண்டு சமோசாவில் பங்கில்லையே கலப்படம் ஏதுமில்லா காலம் அந்த காலம்தானே Friendship'தான் சொத்து நமக்கு Friendship'தான் சொத்து நமக்கு Friendship'தான் சொத்து நமக்கு ஆயிரம் உறவு வந்தாலும் நண்பன் தான் கெத்து நமக்கு நட்புக்கு வயதில்லை என்று ஒரு ஞானி சொன்னானே ஓ சொன்னானே மெய்யான நட்புகிங்கே பிரிவில்லை என்றும் சொன்னானே ஓ சொன்னானே கள்ள தம் அடிச்சி கூட்டா sight அடிச்சி Bike'ல் சுற்றி திரிந்தோம் மொட்ட மாடி மேலே வெட்டி கதை அடிச்சி கோடி ஆண்டு கழித்தோம் நாம் எழில் நதிகளில் ஆடிய ஓடம் வற்றாத கடல் இந்த ரகசிய பாசம் நமக்குள் இருந்ததே இல்லை வெளி வேஷம் தான்... ஆஅ... ஹா... Friendship'தான் சொத்து நமக்கு Friendship'தான் சொத்து நமக்கு Friendship'தான் சொத்து நமக்கு ஆயிரம் உறவு வந்தாலும் நண்பன்தான் கெத்து நமக்கு Friendship'தான் சொத்து நமக்கு"
  },
  {
    "id":"5",
    "name":"Kathaippoma?",
    "movie":"Oh my kadavule",
    "image":"https://i.ytimg.com/vi/Lvq_-hCdZKk/maxresdefault.jpg",
    "link":"",
    "lyrics":"நேற்று நான் உன்னை பார்த்த பார்வை வேறு நீங்காத எண்ணம் ஆக ஆனாய் இன்று உன்னோடு நானும் போன தூரம் யாவும் நெஞ்சிலே ரீங்கார நினைவுகளாக அலையை இங்கே மிஞ்சுதே நூலறுந்த பட்டம் போலே உன்னை சுற்றி நானும் ஆட கைகள் நீட்டி நீயும் பிடிக்க காத்திருக்கிறேன் இதற்கெல்லாம் அர்த்தங்கள் என்ன கேக்க வேண்டும் உன்னை காலம் கை கூடினால் கதைப்போமா கதைப்போமா கதைப்போமா ஒன்றாக நீயும் நானும்தான் கதைப்போமா கதைப்போமா கதைப்போமா நீ பேச பேச காயம் ஆறுமே அதிகாலை வந்தால் அழகாய் என் வானில் நீ அணையாத சூரியன் ஆகிறாய் நெடு நேரம் காய்ந்து கத கதப்பு தந்தவுடன் நிலவாய் உருமாறி நிற்கிறாய் உன்னை இன்று பார்த்ததும் என்னை நானே கேட்க்கிறேன் வைரம் ஒன்றை கையில் வைத்து எங்கே தேடி அலைந்தாயோ உண்மை என்று தெரிந்துமே நெஞ்சம் சொல்ல தயங்குதே கைகள் கோர்த்து பேசினாலே தைரியங்கள் தோன்றுமே கதைப்போமா கதைப்போமா கதைப்போமா(கதைப்போமா) ஒன்றாக நீயும் நானும்தான் கதைப்போமா(கதைப்போமா) கதைப்போமா(கதைப்போமா) கதைப்போமா நீ பேச பேச காயம் ஆறுமே கதைப்போமா(கதைப்போமா) கதைப்போமா(கதைப்போமா) கதைப்போமா கதைப்போமா கதைப்போமா கதைப்போமா ஒன்றாக நீயும் நானும்தான் கதைப்போமா கதைப்போமா கதைப்போமா நீ பேச பேச காயம் ஆறுமே"
  },
  {
    "id":"6",
    "name":"Veyyon Silli",
    "movie":"Soorarai potrtru",
    "image":"https://www.dsrmedias.com/sites/default/files/styles/large/public/field/image/11vv_29.jpg?itok=2zO8VBbc",
    "link":"",
    "lyrics":"சீயஞ் சிறுக்கிகிட்ட சிவன தொலைச்சிட்டேன் சோட்டு வளவிக்குள்ள மாட்டிக்க வளஞ்சிட்டேன் உள்ள பற்றைய போட்டுட்டு ஏழ்ரைய கூட்டிட்டு தப்பிச்சு போறாளே அங்கிட்டு இவ வீதியில் வாரத வேடிக்கை பாக்கத்தான் விழுந்த மேகங்க எம்புட்டு இடுக்கியே... இடுக்கியே... அடிக்கிறா(அடிக்கிறா) அடுக்கியே(அடுக்கியே) வெய்யோன் சில்லி இப்போ நிலத்தில் இறங்கி அனத்துறா லந்தா பேசி என்ன ஒரண்ட இழுக்குறா கட்டாரி கண்ணால உட்டாளே தெரிக்கிறேன் ஒட்டார சிட்டால மப்பாகி கெடக்குறேன் என் உசுருல சல்லட சலிச்சி ஏன் சிரிக்கிற அரக்கியே உன் குறுக்குல என்னைய முடிச்சு நீ நடக்குற தருக்கியே மல்லாட்ட ரெண்டா என்னாட்டம் வந்தா ஓய்... என் உசுருல சல்லட சலிச்சி ஏன் சிரிக்கிற அரக்கியே உன் குறுக்குல என்னைய முடிச்சு நீ நடக்குற தருக்கியே ஹேய்... ஏய்... ஹெய் ஏய் ஏய் என் காது ஜவ்வுல இசையும் ஒவ்வுல நீ மட்டும் பேசடி ஏழட்டு நாளுட்டும் எதுவும் உண்கல இச்சொன்னு வீசடி கண்ணானே உதடு மின்னலு தகடு எனக்கு தானடி சட்டையில் pocket'a தச்சது உன்னைய பதுக்கதானடி தின்னா ஆணம் வெச்சு தின்னா உள்ள உன்கொக்காமக்கா நின்னா ஓய்... என் உசுருல சல்லட சலிச்சி ஏன் சிரிக்கிற அரக்கியே உன் குறுக்குல என்னைய முடிச்சு நீ நடக்குற தருக்கியே தொரட்டி கொரல பெரட்டி எவ்வியே இதயம் பறிச்சியே கரண்டு கம்பியா சொரண்டி கிடந்த கதண்ட எறிச்சியே ஓ பதனம் உதற கவனம் செதற மனச கலைச்சியே கருக்க பொழுதில் சிரிச்சு தொலைச்சு பகல படைச்சியே தீயா இவ வந்தா மண்டவெல்லம் துண்டா உண்டா இந்த ஜிகிர்தண்டா ஓய்... என் உசுருல சல்லட சலிச்சி ஏன் சிரிக்கிற அரக்கியே உன் குறுக்குல என்னைய முடிச்சு நீ நடக்குற தருக்கியே வெய்யோன் சில்லி இப்போ நிலத்தில் இறங்கி அனத்துறா லந்தா பேசி என்ன ஒரண்ட இழுக்குறா கட்டாரி கண்ணாலே உட்டாளே தெரிக்கிறேன் ஒட்டார சிட்டால மப்பாகி கெடக்குறேன்"
  },
  {
    "id":"7",
    "name":"Neenga mudiyuma?",
    "movie":"Psycho",
    "image":"https://i.ytimg.com/vi/srwsHJb4y8U/maxresdefault.jpg",
    "link":"",
    "lyrics":"நீங்க முடியுமா நினைவு தூங்குமா நீங்க முடியுமா நினைவு தூங்குமா காலம் மாறுமா காயம் மாறுமா வானம் பிரிந்த மேகமா வாழ்வில் உனக்கு சோகமா காதல் போயின் காதல் சாகுமா காற்றாகவே நேற்றாகவே நீ போனதேன் உயிர் போகும் நாள் வரை உன்னை தேடுவேன் உனை மீண்டும் பார்த்தப்பின் கண் மூடுவேன் நீங்க முடியுமா நினைவு தூங்குமா தேவன் ஈன்ற ஜீவனாக உன்னை பார்க்கிறேன் மீண்டும் உன்னை வேண்டுமென்று தானம் கேட்கிறேன் நீ கண்கள் தேடும் வழியோ என் கருணை கொண்ட மழையோ நீ மழலை பேசும் மொழியோ என் மனதை நெய்த இழையோ வீசும் தென்றல் என்னை விட்டு விலகி போகுமோ போன தென்றால் என்று எந்தன் சுவாசம் ஆகுமோ இரு விழியிலே ஒரு கனவென உன்னை தொடருவேன்... நீங்க முடியுமா நினைவு தூங்குமா காலம் மாறுமா காயம் மாறுமா மூன்று காலில் காதல் தேடி நடந்து போகிறேன் இரண்டு இரவு இருந்த போதும் நிலவை கேட்கிறேன் நீ கடந்து போன திசையோ நான் கேட்க மறந்த இசையோ நீ தெய்வம் தேடும் சிலையோ உன்னை மீட்க என்ன விலையோ இன்று இல்லை நீ எனக்கு உடைந்து போகிறேன் மீண்டு வாழ நாளை உண்டு மீட்க வருகிறேன் ஒரு தனிமையும் ஒரு தனிமையும் இனி இனையுமே நீங்க முடியுமா நினைவு தூங்குமா காலம் மாறுமா காயம் மாறுமா வானம் பிரிந்த மேகமா வாழ்வில் உனக்கு சோகமா காதல் போயின் காதல் சாகுமா காற்றாகவே நேற்றாகவே நீ போனதேன் உயிர் போகும் நாள் வரை உன்னை தேடுவேன் உனை மீண்டும் பார்த்தப்பின் கண் மூடுவேன் நீங்க முடியுமா நினைவு தூங்குமா"
  },
  {
    "id":"8",
    "name":"Tharam maara Single",
    "movie":"Darbar",
    "image":"https://i.ytimg.com/vi/QUoJIknUk-A/sddefault.jpg#404_is_fine",
    "link":"",
    "lyrics":"Oh! Romance-e Indha Face La, Varlanalum, Oh! Oodama Nippiya, En Kooda Neeyum, Oh Tharam Mara, Single Nanadi, En Pavaiye, Indha Star-Um, Twinkle agave, Nee Thevaye, Purchase Panna, Market Ponene, En Mullaiye, Anga Kuda, Ladies Finger-eh, Ada Illaye, Enga Veetu Calendar, Nalla Date-Ah Kattadha, Vazhakkam Pola Lovers Day, Enakku Mattum April One-ah, Movie Kootti Povena, Latchiyatha Servena, Couple Seat-ah Pappena, Kadasi Varaikkum Only Nana, Romance-e Indha Face La, Varlanalum. Hey, Luba Luba Le Bella, Hey, Luba Luba Le Bella, Hey, Luba Luba Le Bella, Hey, Luba Luba Le Bella Le Bella (x2). Un Accountil Vazhuvan, Analum Sethukodi, Flow Illama Paduven, Thittama Ketukodi, Val Illadha Vanaram, Friend-aga Yethukodi, En Kannoda Sogame, Illama Pathukodi, Nenjodu Set Aga, Fit Aga Yaradi, Ennoda Bloododa, Red Aga Yaradi, Nee Dhanadi, Zero Dhan En Kadhal, Balance Paradi, Beer Owner Kattadha, Loan Aga Neeyadi, Oh Tharam Mara, Single Nanadi, En Pavaiye, Indha Star-Um, Twinkle agave, Nee Thevaye, Purchase Panna, Market Ponene, En Mullaiye, Anga Kuda, Ladies Finger-eh, Ada Illaye, Enga Veetu Calendar, Nalla Date-Ah Kattadha, Vazhakkam Pola Lovers Day, Enakku Mattum April One-Ah, Movie Kootti Povena, Latchiyatha Servena, Couple Seat-Ah Pappena, Kadasi Varaikkum Nan Mattum Thana, Romance-e Indha Face La, Varlanalum, Oodama Nippiya, En Kooda Neeyum, Hey, Luba Luba Le Bella, Hey, Luba Luba Le Bella, Hey, Luba Luba Le Bella, Hey, Luba Luba Le Bella Le Bella (x4)."
  },
  {
    "id":"9",
    "name":"Murada Murada",
    "movie":"Dhanusu Raasi neyarkale",
    "image":"https://i.ytimg.com/vi/jl2sQ1QuhMw/maxresdefault.jpg",
    "link":"",
    "lyrics":"பெண் : ஹ்ம்ம் ம்ம்ம் ஹ்ம்ம் ஹ்ம்ம் ம்ம்ம் ஹ்ம்ம் ஹ்ம்ம் ம்ம்ம் ஹ்ம்ம் ஹ்ம்ம் ம்ம்ம் ஹ்ம்ம் பெண் : இது என்ன என்னுள் ஏதோ விபரீதம் இது போல ஆனது இல்லை ஒருபோதும் பெண் : யாரை நான் கேட்பேன்…… பெண் : இது என்ன என்னுள் ஏதோ விபரீதம்…. இது போல ஆனது இல்லை ஒருபோதும் பெண் : அச்சம் வழிய அணைத்தேன் உனையே அதை நான் நினைத்து சிரித்தேன் தனியே கடைசி வரையில் நீதான் துணையே உன் கை என் தலையணையே பெண் : முரடா முரடா முரடா முழுதும் தருவேன் பொறுடா முரடா முரடா முரடா முழுதும் தருவேன் பொறுடா பெண் : இது என்ன என்னுள் ஏதோ விபரீதம் இது போல ஆனது இல்லை ஒருபோதும் பெண் : ……………………… பெண் : கண் பார்த்திடும் தூரம் அருகில் நீ நின்றே இருந்தாலும் சிறு தூரமும் பெரும் பாரமாய் வதைகின்றதே பெண் : கண்ணாடியை நீயும் கலையாத பிம்பம் போல் நானும் எந்நாளுமே ஒன்றாகவே வரம் கேட்கிறேன்….யேன்…. பெண் : நிழல்கூட நிதமும் இல்லாமல் உலாவ உலாவ தழல்கூட தண்ணீரை போலாகி குலாவ குலாவ பெண் : திமிரோடு கனைத்து அணைத்து முகர்ந்தாய் முகர்ந்தாய் திறக்காத கதவும் திறந்து நுழைந்தாய் நுழைந்தாய் பெண் : முரடா முரடா முரடா முழுதும் தருவேன் பொறுடா பெண் : இது என்ன என்னுள் எதோ விபரீதம் இது போல ஆனது இல்லை ஒருபோதும் பெண் : அச்சம் வழிய அணைத்தேன் உனையே அதை நான் நினைத்து சிரித்தேன் தனியே கடைசி வரையில் நீதான் துணையே உன் கை என் தலையணையே பெண் : முரடா முரடா முரடா முழுதும் தருவேன் பொறுடா முரடா முரடா முரடா முழுதும் தருவேன் பொறுடா"
  },
  {
    "id":"10",
    "name":"Thalelo",
    "movie":"Thampy",
    "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcQxnZBuT9MBJ7kdtR14I5a5mNkhJ8YVmtYk1g&usqp=CAU",
    "link":"",
    "lyrics":"தாலேலோ பாடுதே காதலே பூப் போலே தூங்குதே நாணமே ஓ ஏதேதோ ஆகுதே மார்பிலே வான் மேலே போகுதே ஆடலே நீ எனை ஏதோ செய்கிறாய் ஆ... ஆ... தீமையால் கண்ணின் நீர் நீக்கி பூ வைத்து பார்க்கிறாய் உன் பிம்பத்தின் சீண்டல்களால் காண்கின்ற யாவும் வாசமே இதோ இதோ கனா மெய்யாகுதே... போக கூடாத தூரங்கள் போனாலுமே... நீ மாற கூடாமல் பிரேமைகள் பூ பூக்குமே... வா கேட்க கூடாத வார்த்தைகள் கேட்டாலுமே... காதில் நீ பேசும் மௌனங்கள் காப்பாற்றுமே... கூறாமல் நீ போக ஆழம் நான் ஏங்க சாம்பல் ஆகாத கண்ணீரில் வாழ்ந்தேனே ஏழ் ஏழேழு காலங்கள் தீர்ந்து போனாலும் ஆண்மை சூட்டோடு அலைவேனே உன்னை தேடியே நீ... மலை காட்டிலே தொடரும் அசரீரீ நீ..."
  },
  {
    "id":"11",
    "name":"Mayilaanchi",
    "movie":"Namma veeddu pillai",
    "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRjbwvvNz_VP_kf-1sFp9ab_N93PYfA9KPLRw&usqp=CAU",
    "link":"",
    "lyrics":"மயிலாஞ்சி மயிலாஞ்சி மாமன் ஓன் மயிலாஞ்சி கையோடும் காலோடும் பூசேன்டி என ஆஞ்சி கண்ணாடி போல காதல் உன்ன காட்ட ஈரேழு லோகம் பாத்து நிக்குறேன் கண்ணால நீயும் நூல விட்டு பாக்க காத்தாடியாக நானும் சுத்துறேன் சதா சதா சந்தோஷமாகுறேன் மனோகரா உன் வாசத்தால் உன்னால நானும் நூறாகுறேன் பறக்குறேன் பறக்குறேன் தெரிஞ்சுக்கடி உனக்கு நான் எனக்கு நீ புரிஞ்சுக்கடி மயிலாஞ்சி மயிலாஞ்சி மாமா நீ மயிலாஞ்சி கையோடும் காலோடும் பூசேன்டி என ஆஞ்சி பறக்குறேன் பறக்குறேன் தெரிஞ்சுக்கடி உனக்கு நான் எனக்கு நீ புரிஞ்சுக்கடி கோயில் மணியோசை கொலுசோட கலந்து பேச மனசே தாவுகின்றதே தாயின் உடல் சூட்ட மறவாத குழந்தை போல உசுரே ஊறுகின்றதே விளக்கும் கூட வெள்ளி நிலவாக தெரியும் கோலம் என்னவோ கணக்கில்லாம வந்து விடும் காதல் குழப்பும் செய்தி அல்லவோ அழகா நீ பேசும் தமிழ அறிஞ்சா ஓடாதோ கவலை உன நான் தாலாட்டவேனே மனகூட்டுல மயிலாஞ்சி மயிலாஞ்சி…"
  },
  {
    "id":"12",
    "name":"Un koodave porakkanum",
    "movie":"Namma veeddu pillai",
    "image":"https://i.ytimg.com/vi/YFUBso2EbnM/maxresdefault.jpg",
    "link":"",
    "lyrics":"உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் உனக்காக நான் இருக்கனும் எப்போதுமே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் தாய் போல நான் காக்கணும் எப்போதுமே என் வாழ்க்க வரமாக அட நீயும் பொறந்தாயே என் உயிரே உறவாக என் நெஞ்சில் கரைஞ்சாயே பசி தூக்கத்த மறந்து நீயும் அடி பாசத்த பொழிஞ்சாயே தெனம் உன் முகம் பார்த்து பூக்கும் புது விடியலும் தந்தாயே நீ எனக்கு சாமி இந்த பூமி அட எல்லாம் நீ தானே உன் சிரிப்பு போதும் நீ கேட்டா என் உசுர தாரேனே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் உனக்காக நான் இருக்கனும் எப்போதுமே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் தாய் போல நான் காக்கணும் எப்போதுமே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் உனக்காக நான் இருக்கனும் எப்போதுமே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் தாய் போல நான் காக்கணும் எப்போதுமே அஞ்சு விரல்கள கோர்த்து நாம பத்து விரலா ஆனோம் மணகோலத்தில் பார்த்தா அந்த சின்ன பொண்ண காணோம் சில நாளில் நீ என் தாயே சில நாளில் நீ என் சேயே நீ மடிமேல் சாயும்போது அந்த வானம் விரிக்கும் பாயே எப்போதுமே என்கூடத்தான் என்று நினைச்சேன் இப்போ நீயோ போகும் போது செத்து பொழச்சேன் நீதானே கொலசாமி ஒரு வரமும் தாயேன் மகளாக பொறப்பேன்னு நீ சொல்லி போயேன் உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் உனக்காக நான் இருக்கனும் எப்போதுமே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் தாய் போல நான் காக்கணும் எப்போதுமே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் உனக்காக நான் இருக்கனும் எப்போதுமே உன் கூடவே பொறக்கணும் உன் கூடவே பொறக்கணும் தாய் போல நான் காக்கணும் எப்போதுமே"
  },
  {
    "id":"13",
    "name":"Sanda kaari",
    "movie":"Sangathamizhan",
    "image":"https://i.ytimg.com/vi/rNQ59clpmFs/maxresdefault.jpg",
    "link":"",
    "lyrics":"என் சண்டகாரி நீதான் என் சண்டகோழி நீதான் சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான் ஹே என்னை தாண்டி போறவளே ஓரக்கண்ணால் ஒரு பார்வை பார்த்து என்ன கொன்ன சரியா நடந்தாலும் தானாவே சறுக்குறேன் என்னடி என்ன பண்ண ஏதோ மாறுதே போத ஏறுதே உன்ன பார்கையில ஏதோ ஆகுதே எல்லாம் சேருதே கொஞ்சம் சிரிக்கையில என்ன தாண்டி போனா கண்ண காட்டி போனா என்ன தாண்டி போனா கண்ண காட்டி போகும்போதே என்ன அவ கொண்டு போனா சண்டகாரி நீதான் என் சண்டகோழி நீதான் சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான் சண்டகாரி நீதான் என் சண்டகோழி நீதான் அட சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான் சண்டகாரி நீதான் என் சண்டகோழி நீதான் அட சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான் சண்டகாரி நீதான் என் சண்டகோழி நீதான் அட சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான் மழைத்துளி நீ, மழலையும் நான் நீ என்னை சேர காத்திருப்பேனே இறைமதி நீ, நில ஒளி நான் அடி நீ வரும் நேரம் பாத்திருப்பேனே இது ஏனோ புது மயக்கம் தெளிந்திட எண்ணம் ஏனோ இல்லை இனி வேண்டாம் ஒரு தயக்கம் இறுதி வரை நம் பிரிவே இல்லை(இல்லை) என்னை தாண்டி போறவளே ஓரக்கண்ணால் ஒரு பார்வை பார்த்து என்ன கொன்ன(பார்த்து என்ன கொன்ன) சரியா நடந்தாலும் தானாவே சறுக்குறேன் என்னடி என்ன பண்ண (என்னடி என்ன பண்ண) ஏதோ மாறுதா, போதை ஏறுதா என்ன பார்கையில ஏதோ ஆகுதா எல்லாம் மாருதா கொஞ்சம் சிரிக்கையில என்ன தாண்டி போனா கண்ண காட்டி போனா என்ன தாண்டி போனா கண்ண காட்டி போகும்போதே என்ன அவ கொண்டு போனா சண்டகாரி நீதான் என் சண்டகோழி நீதான் சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான் சண்டகாரி நீதான் என் சண்டகோழி நீதான் அட சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான் ஹே என்னை தாண்டி போனா கண்ண காட்டி போனா சண்டகாரி நீதான் நீதான் நீதான் என் சொந்தமெல்லாம் நீதான்"
  },
  {
    "id":"14",
    "name":"Unakkaka",
    "movie":"Bigil",
    "image":"https://i.ytimg.com/vi/2b6mFP4abZQ/maxresdefault.jpg",
    "link":"",
    "lyrics":"உனக்காக வாழ நினைக்கிறேன் உசுரோட வாசம் புடிக்கிறேன் பொடவ மடிக்கையில் உன்னத்தான் மடிக்கிறேன் ஒரு நூறு வருஷம் பேச நினைச்சி தோளில் தூங்கிடுவேன் உனக்காக... உனக்காக உனக்காக வாழ நினைக்கிறேன் உசுரோட வாசம் புடிக்கிறேன் எச கேட்டா நீதானோ... நெறமெல்லாம் நீதானோ... தினம் நீ தூங்கும் வரைதான் என் வாழ்க்கையே விடிஞ்சு உன் பேச்சொலி கேட்டாதான் எடுப்பேன் மூச்சையே உன்ன சுமக்குற வரமா மேல நிழல் வந்து விழுமா கொல்லாதே கண்ணின் ஓரமா உனக்காக வாழ நினைக்கிறேன் (உனக்காக வாழ நினைக்கிறேன்) உசுரோட வாசம் புடிக்கிறேன் (உசுரோட வாசம் புடிக்கிறேன்) ஒரே மழை அள்ளி நம்ம போத்திக்கணும் ஹோ கைய குடு கதவாக்கி சாத்திக்கணும் ஒரே குளிர் ஒரே முத்தம் ஊட்டிக்கணும் உன்ன மட்டும் உசுராக பாத்துக்கணும் நிலா மழ மொழி அல பனி இருள் கிளி கெள நீயும் நானும் தெகட்ட தெகட்ட ரசிக்கணும் உனக்காக வாழ நினைக்கிறேன் (உசுரோட வாசம் புடிக்கிறேன்) உசுரோட வாசம் புடிக்கிறேன் (உனக்காக வாழ நினைக்கிறேன்) பொடவ மடிக்கையில் உன்னத்தான் மடிக்கிறேன் ஒரு நூறு வருஷம் பேச நினைச்சி தோளில் தூங்கிடுவேன் உனக்காக... உனக்காக உனக்காக வாழ நினைக்கிறேன் உசுரோட வாசம் புடிக்கிறேன் உசுரோட வாசம் புடிக்கிறேன்"
  },
  {
    "id":"15",
    "name":"5 manikku",
    "movie":"Puppy",
    "image":"https://i.ytimg.com/vi/CTW4pqSHH3I/maxresdefault.jpg",
    "link":"",
    "lyrics":"அந்த சாலை ஓரம் அந்தி சாயும் நேரம் உன் சேலை ஆடுதே என் நெஞ்சம் வாடுதே நீ பேசா நொடி என்னை கொல்லும்படி பல வேஷம் போடுதே என்னை கட்டி ஆளுதே... நான் என்பதே அடி நீதானடி சேந்துதான் ஏத்து உன் காதல் கொடி பேசாம நீ வந்து கையப்புடி ஒன்னாதான் நாம் சேர்ந்து அடிச்சிப்போம்டி புடிச்சுப்போம்டி அஞ்சு மணிக்கு உன் கைய புடிச்சேன் ஆறு மணிக்கு உன்ன கட்டி அணைச்சேன் ஏழு மணிக்கு ஒரு முத்தம் கொடுத்தேன் எட்டு மணிக்கு நான் தூக்கத்துல கண்ண முழிச்சேன் ஹேய் அஞ்சு மணிக்கு உன் கைய புடிச்சேன் ஆறு மணிக்கு உன்ன கட்டி அணைச்சேன் ஏழு மணிக்கு ஒரு முத்தம் கொடுத்தேன் எட்டு மணிக்கு நான் தூக்கத்துல கண்ண முழிச்சேன் கண்ணு ரெண்டு மேயுதடி காதல் வந்து பாயுதடி நான் பொறுத்தது போதுமடி வாடி வாடி ஓடி ஓடி காதல் செய்ய நானும் ready ஹேய் அஞ்சு மணிக்கு உன் கைய புடிச்சேன் ஆறு மணிக்கு உன்ன கட்டி அணைச்சேன் ஏழு மணிக்கு ஒரு முத்தம் கொடுத்தேன் எட்டு மணிக்கு நான் தூக்கத்துல கண்ண முழிச்சேன் அந்த சாலை ஓரம் நீ காத்திருந்த நேரம் உன்ன மெளனமாக ரசிச்சேன் எனக்குள்ள நானும் சிரிச்சேன் உன் பார்வை தினுசு இது எனக்கு ரொம்ப புதுசு என்ன எனக்கே அழகா உன் கண்ணு காட்டுதடா List போடு, உன் ஆசை எல்லாம் ஒரு நல்ல நாள் வரும் வரை காத்திருடா ஏக்கம் உள்ள ஊஞ்சல் ஆடுதடா என்ன கல்யாணம் பண்ணிட்டு அணைச்சுகடா, கட்டி புடிச்சுகடா அஞ்சு மணிக்கு என் கைய புடிச்ச ஆறு மணிக்கு என்ன கட்டி அணைச்ச ஏழு மணிக்கு ஒரு முத்தம் கொடுத்த எட்டு மணியில எதுக்குடா கண்ண முழிச்ச அஞ்சு மணிக்கு என் கைய புடிச்ச ஆறு மணிக்கு என்ன கட்டி அணைச்ச ஏழு மணிக்கு ஒரு முத்தம் கொடுத்த எட்டு மணியில எதுக்குடா கண்ண முழிச்ச கண்ணு ரெண்டு மேயுதடி காதல் வந்து பாயுதடி நான் பொறுத்தது போதுமடி வாடி வாடி ஓடி ஓடி காதல் செய்ய நானும் ready வெறும் சொல்லால் என் காதல் சொல்ல வார்த்தை இங்கு இல்லை என் சுவாசம் உன்னை தீண்ட நான் கண்ண அடிக்க நீ கட்டி புடிக்க என்ன எனக்கே கிள்ளி பாக்க தோணுதடி அஞ்சு மணிக்கு உன் கைய புடிச்சேன் ஆறு மணிக்கு உன்ன கட்டி அணைச்சேன் ஏழு மணிக்கு ஒரு முத்தம் கொடுத்தேன் எட்டு மணிக்கு... கொஞ்சம் பொறுடா நீ காத்து இருடா உன் கனவெல்லாம் பழிக்க நேரம் வருமடா ஆசை எல்லாம் நித்தம் சேர்த்து வையடா மூச்சு முட்ட முட்ட முத்தம் தர காத்திருக்கேன்டா கண்ணு ரெண்டு மேயுதடி காதல் வந்து பாயுதடி நான் பொறுத்தது போதுமடி வாடி வாடி வாடி வாடி அஞ்சு மணிக்கு என் கைய புடிச்ச(நான் ரெடி) ஆறு மணிக்கு என்ன கட்டி அணைச்ச(நான் ரெடி) ஏழு மணிக்கு ஒரு முத்தம் கொடுத்த எட்டு மணியில எதுக்குடா கண்ண முழிச்ச காத்திருப்பேன்..."
  },
  {
    "id":"16",
    "name":"Unmai ethu",
    "movie":"Saaho",
    "image":"https://i.ytimg.com/vi/iJZqWYuEw0I/maxresdefault.jpg",
    "link":"",
    "lyrics":"Oru Paadhi Mei Enbadha Maru Paadhi Poi Enbadha Avai Rendum Ondre Yena... En Kangal Poi Solludha Kanavellam Mei Enbadha Nijamellam Poi Enbadha Avai Rendum Ondre Yena... En Nenjam Mei Solludha Unmai Edhu Poi Edhu Sollidu Anbe Unmai Edhu Poi Edhu... Unmai Edhu Poi Edhu Sollidu Anbe Unmai Edhu Poi Edhu... Ithan Munne Kaana Vizha Tholaigindren En Kadhala Poi Ennum Vaan Midhile... Mei Endra Thondrum Nila Izha Ootha Vinnin Ozhi Vizhi Rendil En Kadhali Mei Ennum Kaar Ondrile... Poi Endra Kichum Kili Unmai Edhu Poi Edhu Sollidu Anbe Unmai Edhu Poi Edhu... Unmai Edhu Poi Edhu Sollidu Anbe Unmai Edhu Poi Edhu... vaanam engengum boomippandhengum ellaamee azhagaay endhan kangaloa unnai mattum kaanudhae Nenjam engengum koadi malaigal vedithu eriya en kaamamoa un theeyai kaetkudhae poonraarai karai , kannettum varai yen vazhvin maarai neemattum thirai Muthathil uraindhen uyir idhu meyya ena soadhithu anbae nee solladee Unmai Edhu Poi Edhu Sollidu Anbe Unmai Edhu Poi Edhu... Unmai Edhu Poi Edhu Sollidu Anbe Unmai Edhu Poi Edhu..."
  }
];

function App(){
  return(
    <BrowserRouter>
        <Route path="/" component={Navbar}/>
        <Route exact path="/" component={Home}/>
        <Route exact path="/react-app" component={Home}/>
        <Route exact path="/song" component={Songs}/>
        <Route path="/song/:id" component={Songdetail}/>
        <Route path="/" component={Footer}/>
      </BrowserRouter>
  )
}

export {App,Fullsongs};
